content/assignments/week2.md
+++
title = "Week 2 – Freedom & Agency"
publishDate = 2020-08-25T00:00:00-04:00
tags = ["action", "agency", "causality", "freedom", "metaphysics", "substance"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

This week we’ll start with discussion of Kant’s general commitments concerning substantial
activity and agency. Then we’ll look more closely at Kant’s conception of free action. We’ll
discuss the differences between ‘practical’ and ‘transcendental’ freedom and why the
former might depend on the latter.


## Readings {#readings}

Please note that while I’ve provided whole sections for context, you’re only expected
to read the specified pages.

-   From Kant:
    -   CPR: [The Third Antinomy](/materials/readings/kant-antinomies.pdf) (excerpt, A532/B560–A558/B586)
        -   Note that an “antinomy” here is a conflict of reason with itself. We’ll
            discuss the general issues at stake in the antinomies but the focus will be
            on Kant’s positive conception of “transcendental freedom” in the Third
            Antinomy
    -   CPR: [The Canon of Pure Reason](/materials/readings/kant-canon.pdf) (excerpt, A800/B828–A804/B832)
        -   Here we see Kant discussing “practical freedom”, seemingly in isolation from
            any discussion of freedom in the Antinomies. What is practical freedom and
            what is its relationship to transcendental freedom?
    -   CPrR: [Critical Elucidation of the Analytic of Pure Practical Reason](/materials/readings/kant-elucidation.pdf) (excerpt, 5:94-102)
        -   Here we see a clear argument that freedom of any kind the grounds
            responsibility depends on transcendental freedom – why?
    -   MM: [Metaphysics of Morals](/materials/readings/kant-mm-intro.pdf) (excerpt,
        §§II-III, 6:211-14, 6:221-28)
        -   A useful rundown of what Kant means by various terms (e.g. desire, choice,
            will, person, deed, imputation)
-   Secondary readings (While it is not necessary to read all three of these, I encourage you to read at least one):
    -   Wood, “[Kant’s Compatibilism](/materials/readings/wood-compatibilism.pdf)”
    -   Pereboom, “[Kant on Transcendental Freedom](/materials/readings/pereboom-freedom.pdf)”
    -   Allison, “[Kant on Freedom of the Will](/materials/readings/allison-freewill.pdf)”
